HeatSink_Base/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Der exakte Name des Solvers für die thermische Kopplung
application     chtMultiRegionSimpleFoam;

startFrom       latestTime; 

startTime       0;

stopAt          endTime;

endTime         450;   

deltaT          1;          

writeControl    timeStep;

writeInterval   450;       

purgeWrite      0;          

writeFormat     ascii;   

writePrecision  8;

compression     off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true; 

functions
{
    yPlus1
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        region          fluidDomain; 
        enabled         true;
        writeControl    writeTime;
    }
    heatFlux
    {
        type            wallHeatFlux;
        libs            (fieldFunctionObjects);
        region          fluidDomain;
        enabled         true;
        writeControl    writeTime;
    }
}

// ************************************************************************* //