HeatSink_Base/constant/heatSink/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          hConst;
    equationOfState rhoConst;         // KORREKTUR: Muss exakt mit der Tabelle übereinstimmen
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       26.98;        // Aluminium
    }
    
    transport
    {
        kappa           200;          // W/(m K)
    }
    
    thermodynamics
    {
        Hf              0;
        Cp              900;          // J/(kg K)
    }
    
    // KORREKTUR: Passend zu rhoConst wird hier einfach direkt die Dichte definiert
    equationOfState
    {
        rho             2700;         // Konstante Dichte in kg/m³ (Aluminium)
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //