HeatSink_Base/0/fluidDomain/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0/fluidDomain";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 5 0 );

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value           uniform ( 0 5 0 );
    }
    Outlet
    {
        type            zeroGradient;
    }
    fluidDomain_fluid_wall
    {
        type            noSlip;
    }
    walls
    {
        type            noSlip;
    }
    fluidDomain_to_heatSink
    {
        type            noSlip;
    }
}


// ************************************************************************* //
