HeatSink_Base/0/fluidDomain/cellDist
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/fluidDomain";
    object      cellDist;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1181056
(
2
2
2
2
2
2
2
2
...
)
;

boundaryField
{
    fluidDomain_fluid_wall
    {
        type            zeroGradient;
    }
    Inlet
    {
        type            zeroGradient;
    }
    Outlet
    {
        type            zeroGradient;
    }
    fluidDomain_to_heatSink
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
