HeatSink_Base/0/fluidDomain/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value           uniform 0.01;
    }
    Outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.01;
        value           uniform 0.01;
    }
    fluidDomain_fluid_wall
    {
        type            kLowReWallFunction;
        value           uniform 0.01;
    }
    walls
    {
        type            kLowReWallFunction;
        value           uniform 0.01;
    }
    fluidDomain_to_heatSink
    {
        type            kLowReWallFunction;
        value           uniform 0.01;
    }
}