HeatSink_Base/0/fluidDomain/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2.0;

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value           uniform 2.0;
    }
    Outlet
    {
        type            inletOutlet;
        inletValue      uniform 2.0;
        value           uniform 2.0;
    }
    fluidDomain_fluid_wall
    {
        type            omegaWallFunction;
        value           uniform 2.0;
    }
    walls
    {
        type            omegaWallFunction;
        value           uniform 2.0;
    }
    fluidDomain_to_heatSink
    {
        type            omegaWallFunction;
        value           uniform 2.0;
    }
}