HeatSink_Base/0/heatSink/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/heatSink";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 345;

boundaryField
{
    heater
    {
        type            externalWallHeatFluxTemperature;
        mode            flux;
        q               uniform 50000;
        kappaMethod     solidThermo;
        value           uniform 293.15;
    }
    heatSink_to_fluidDomain
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        kappaMethod     solidThermo;
        Tnbr            T;
        nbrRegion       fluidDomain;
        value           uniform 293.15;
    }
}


// ************************************************************************* //
