HeatSink_Base/system/fluidDomain/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p_rgh.*"
    {
        solver          GAMG;
        tolerance       1e-07;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    "(U|h|e|k|omega).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU; // Für asymmetrische Fluidmatrizen
        tolerance       1e-08;
        relTol          0.01;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    consistent      yes;
}

relaxationFactors
{
    fields
    {
        p_rgh           0.5;
        rho             0.5;
    }
    equations
    {
        U               0.5;
        h               0.5;
        e               0.5;
        "h.*"           0.5;
        "e.*"           0.5;
        k               0.5;
        omega           0.5;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //