HeatSink_Base/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

heatSink.stl
{
    extractionMethod    extractFromSurface;
    
    extractFromSurfaceCoeffs
    {
        includedAngle   150;
    }
}

//heatSource.stl
//{
//    extractionMethod    extractFromSurface;
//    
//    extractFromSurfaceCoeffs
//    {
//        includedAngle   150;
//    }
//}

fluidDomain.stl
{
    extractionMethod    extractFromSurface;
    
    extractFromSurfaceCoeffs
    {
        includedAngle   150;
    }
}
    




// ************************************************************************* //
